post/其他/游戏/unciv/Unciv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2023-06-07 三 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Unciv——一款模拟文明游戏</title>
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="description" content="一款仿照文明5的文明模拟策略游戏" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/theme/org-html-theme-dull.css"/>
<link rel="shortcut icon" href="/img/icon.jpg">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Unciv——一款模拟文明游戏</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5d8a27c">1. Unciv简介</a>
<ul>
<li><a href="#orgc579972">1.1. 简介</a></li>
<li><a href="#org941401a">1.2. 下载&amp;安装</a>
<ul>
<li><a href="#org73bb6be">1.2.1. 下载渠道链接表（备用）</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf83028e">2. 开始玩Unciv！</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5d8a27c" class="outline-2">
<h2 id="org5d8a27c"><span class="section-number-2">1.</span> Unciv简介</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc579972" class="outline-3">
<h3 id="orgc579972"><span class="section-number-3">1.1.</span> 简介</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Unciv是一款仿照文明5的，用Java编写的，对模组有好的，易于运行的文明模拟游戏。而其
<a href="https://github.com/yairm210/Unciv">官网</a>的介绍为：
</p>
<blockquote>
<p>
An open source, mod-friendly Android and Desktop remake of Civ V, made with
LibGDX
</p>
</blockquote>
<p>
你或许会问：“一个仿制文明5制作的游戏，好玩吗？”实际上，在游戏性上，他是绝对不
输文明5的，有着相当完善的功能和玩法。同时，在文章编写时，游戏的开发仍旧非常活跃，
能够“肉眼可见”地看见功能的加入和完善——对的，尽管这是一款英文游戏，但是有着很高
的翻译完成度，足见玩家的热情。
</p>
</div>
</div>
<div id="outline-container-org941401a" class="outline-3">
<h3 id="org941401a"><span class="section-number-3">1.2.</span> 下载&amp;安装</h3>
<div class="outline-text-3" id="text-1-2">
<p>
它的官网（Github）已经给出了完整的下载渠道，基于Java的特性，它基本支持全平台。抛
开Java依赖的大小后，其本体的大小还是非常小的。尽管在官网上Falthub、windows、
android三个平台的安装包大小如下： <code>109M</code> <code>85M</code> <code>19M</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>。
</p>

<p>
值得注意的是，Android平台上建议使用F-droid下载，因为谷歌没有魔法根本连不上。而
F-droid的服务器在外国，所以下载速度会很慢。如果希望能够持续快速更新的话，可以尝
试下载它的客户端更换使用清华源下载。
</p>

<p>
还有Linux平台（针对Arch用户），Unciv在archlinuxcn源上有已经打包好的软件包可以直
接安装，不用去下载flathub的版本，并且更新频率较高。
</p>
</div>
<div id="outline-container-org73bb6be" class="outline-4">
<h4 id="org73bb6be"><span class="section-number-4">1.2.1.</span> 下载渠道链接表（备用）</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">系统</th>
<th scope="col" class="org-left">网站链接</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Windows</td>
<td class="org-left"><a href="https://yairm210.itch.io/unciv">itch.io</a></td>
</tr>

<tr>
<td class="org-left">Android</td>
<td class="org-left"><a href="https://play.google.com/store/apps/details?id=com.unciv.app">Google Play</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://f-droid.org/en/packages/com.unciv.app/">F-droid</a></td>
</tr>

<tr>
<td class="org-left">Linux/ <del>Mac?</del></td>
<td class="org-left"><a href="https://flathub.org/apps/details/io.github.yairm210.unciv">Flathub</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf83028e" class="outline-2">
<h2 id="orgf83028e"><span class="section-number-2">2.</span> 开始玩Unciv！</h2>
<div class="outline-text-2" id="text-2">
<p>
实际上Unciv内置有较为完善的新手引导教程，不懂得也可以去内置的百科里面翻翻，我这
种菜鸡也不好意思在这里班门弄斧。不过我建议，难度先玩移民，慢慢再提上去，要不然轻
轻松松实现《Unciv从入门到退坑》。（注：难度是自上而下增加的，上面简单下面难），
其他的设置保持默认就好。不建议开太大的地图，否则会很卡，文明数量也不建议设置太多。
</p>

<p>
不过要提一点：建议选择特定的文明玩而非随机，不同的文明是有属性加成的。例如说阿拉
伯会增加石油产量之类的。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
实际上我觉得这里挺有趣的，Android本身就是由Java编写的，所以约等于已经有了
依赖，不用再装Java环境，所以很小
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-06-07 三 11:58</p>
<p class="author">Author: 不要在意我的头像QwQ</p>
<p class="date">Created: 2023-06-07 三 14:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
